zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SPI_FILTER.h
/*
** ###################################################################
**     Processors:          MCXA286VLL
**                          MCXA286VLQ
**                          MCXA286VPN
**                          MCXA287VLL
**                          MCXA287VLQ
**                          MCXA287VPN
**                          MCXA456VLL
**                          MCXA456VLQ
**                          MCXA456VPN
**                          MCXA457VLL
**                          MCXA457VLQ
**                          MCXA457VPN
**                          MCXA536VLL
**                          MCXA536VLQ
**                          MCXA536VPN
**                          MCXA537VLL
**                          MCXA537VLQ
**                          MCXA537VPN
**                          MCXA556VPN
**                          MCXA566VLL
**                          MCXA566VLQ
**                          MCXA566VPN
**                          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**                          MCXA577VLL
**                          MCXA577VLQ
**                          MCXA577VPN
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b251029
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SPI_FILTER
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_SPI_FILTER.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for SPI_FILTER
 *
 * CMSIS Peripheral Access Layer for SPI_FILTER
 */

#if !defined(PERI_SPI_FILTER_H_)
#define PERI_SPI_FILTER_H_                       /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA286VLL) || defined(CPU_MCXA286VLQ) || defined(CPU_MCXA286VPN))
#include "MCXA286_COMMON.h"
#elif (defined(CPU_MCXA287VLL) || defined(CPU_MCXA287VLQ) || defined(CPU_MCXA287VPN))
#include "MCXA287_COMMON.h"
#elif (defined(CPU_MCXA456VLL) || defined(CPU_MCXA456VLQ) || defined(CPU_MCXA456VPN))
#include "MCXA456_COMMON.h"
#elif (defined(CPU_MCXA457VLL) || defined(CPU_MCXA457VLQ) || defined(CPU_MCXA457VPN))
#include "MCXA457_COMMON.h"
#elif (defined(CPU_MCXA536VLL) || defined(CPU_MCXA536VLQ) || defined(CPU_MCXA536VPN))
#include "MCXA536_COMMON.h"
#elif (defined(CPU_MCXA537VLL) || defined(CPU_MCXA537VLQ) || defined(CPU_MCXA537VPN))
#include "MCXA537_COMMON.h"
#elif (defined(CPU_MCXA556VPN))
#include "MCXA556_COMMON.h"
#elif (defined(CPU_MCXA566VLL) || defined(CPU_MCXA566VLQ) || defined(CPU_MCXA566VPN))
#include "MCXA566_COMMON.h"
#elif (defined(CPU_MCXA567VLL) || defined(CPU_MCXA567VLQ) || defined(CPU_MCXA567VPN))
#include "MCXA567_COMMON.h"
#elif (defined(CPU_MCXA577VLL) || defined(CPU_MCXA577VLQ) || defined(CPU_MCXA577VPN))
#include "MCXA577_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SPI_FILTER Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SPI_FILTER_Peripheral_Access_Layer SPI_FILTER Peripheral Access Layer
 * @{
 */

/** SPI_FILTER - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< Control, offset: 0x0 */
  __I  uint32_t ISR;                               /**< Interrupt Register, offset: 0x4 */
  __IO uint32_t IMR;                               /**< Interrupt Mask Register, offset: 0x8 */
  __I  uint32_t SR;                                /**< Port Status Register, offset: 0xC */
  __IO uint32_t TR;                                /**< Test Register, offset: 0x10 */
  __IO uint32_t P0FAR1;                            /**< PORT0 Filter Address Region 1, offset: 0x14 */
  __IO uint32_t P0FAR2;                            /**< PORT0 Filter Address Region 2, offset: 0x18 */
  __IO uint32_t P0FAR3;                            /**< PORT0 Filter Address Region 3, offset: 0x1C */
  __IO uint32_t P0FAR4;                            /**< PORT0 Filter Address Region 4, offset: 0x20 */
  __IO uint32_t P0FAR5;                            /**< PORT0 Filter Address Region 5, offset: 0x24 */
  __IO uint32_t P0FAR6;                            /**< PORT0 Filter Address Region 6, offset: 0x28 */
  __IO uint32_t P1FAR1;                            /**< PORT1 Filter Address Region 1, offset: 0x2C */
  __IO uint32_t P1FAR2;                            /**< PORT1 Filter Address Region 2, offset: 0x30 */
  __IO uint32_t P1FAR3;                            /**< PORT1 Filter Address Region 3, offset: 0x34 */
  __IO uint32_t P1FAR4;                            /**< PORT1 Filter Address Region 4, offset: 0x38 */
  __IO uint32_t P1FAR5;                            /**< PORT1 Filter Address Region 5, offset: 0x3C */
  __IO uint32_t P1FAR6;                            /**< PORT1 Filter Address Region 6, offset: 0x40 */
       uint8_t RESERVED_0[4];
  __IO uint32_t POPCODE0;                          /**< Programmable OP Code0, offset: 0x48 */
  __IO uint32_t POPCODE1;                          /**< Programmable OP Code1, offset: 0x4C */
  __IO uint32_t POPCODE2;                          /**< Programmable OP Code2, offset: 0x50 */
  __IO uint32_t POPCODE3;                          /**< Programmable OP Code3, offset: 0x54 */
  __IO uint32_t POPCODE4;                          /**< Programmable OP Code4, offset: 0x58 */
  __I  uint32_t P0BOC;                             /**< P0 Blocked Op Code, offset: 0x5C */
  __I  uint32_t P1BOC;                             /**< P1 Blocked Op Code, offset: 0x60 */
  __IO uint32_t P0MAM;                             /**< PORT0 Max Address Mask, offset: 0x64 */
  __IO uint32_t P1MAM;                             /**< PORT1 Max Address Mask, offset: 0x68 */
} SPI_FILTER_Type;

/* ----------------------------------------------------------------------------
   -- SPI_FILTER Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SPI_FILTER_Register_Masks SPI_FILTER Register Masks
 * @{
 */

