zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SPI_FILTER.h
/*! @name CR - Control */
/*! @{ */

#define SPI_FILTER_CR_P1_SINGLE_FLASH_MASK       (0x1U)
#define SPI_FILTER_CR_P1_SINGLE_FLASH_SHIFT      (0U)
/*! P1_SINGLE_FLASH - Flash memory organization
 *  0b0..Sets flash memory organization to Dual Flash mode.
 *  0b1..Sets flash memory organization to Single Flash mode.
 */
#define SPI_FILTER_CR_P1_SINGLE_FLASH(x)         (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_SINGLE_FLASH_SHIFT)) & SPI_FILTER_CR_P1_SINGLE_FLASH_MASK)

#define SPI_FILTER_CR_P1_SINGLE_FLASH_CHIP_SELECT_MASK (0x2U)
#define SPI_FILTER_CR_P1_SINGLE_FLASH_CHIP_SELECT_SHIFT (1U)
/*! P1_SINGLE_FLASH_CHIP_SELECT - Single Flash mode Chip Select
 *  0b0..Enables output to CS0 as the active chip.
 *  0b1..Enables output to CS1 as the active chip.
 */
#define SPI_FILTER_CR_P1_SINGLE_FLASH_CHIP_SELECT(x) (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_SINGLE_FLASH_CHIP_SELECT_SHIFT)) & SPI_FILTER_CR_P1_SINGLE_FLASH_CHIP_SELECT_MASK)

#define SPI_FILTER_CR_P1_SINGLE_FLASH_ALLOW_WRITE_MASK (0x4U)
#define SPI_FILTER_CR_P1_SINGLE_FLASH_ALLOW_WRITE_SHIFT (2U)
/*! P1_SINGLE_FLASH_ALLOW_WRITE - Single Flash Allow Write
 *  0b0..Normal operation. Writes are not allowed to unfiltered regions.
 *  0b1..Writes are allowed to unfiltered regions.
 */
#define SPI_FILTER_CR_P1_SINGLE_FLASH_ALLOW_WRITE(x) (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_SINGLE_FLASH_ALLOW_WRITE_SHIFT)) & SPI_FILTER_CR_P1_SINGLE_FLASH_ALLOW_WRITE_MASK)

#define SPI_FILTER_CR_P0_SINGLE_FLASH_MASK       (0x100U)
#define SPI_FILTER_CR_P0_SINGLE_FLASH_SHIFT      (8U)
/*! P0_SINGLE_FLASH - Flash memory organization
 *  0b0..Sets flash memory organization to Dual Flash mode.
 *  0b1..Sets flash memory organization to Single Flash mode.
 */
#define SPI_FILTER_CR_P0_SINGLE_FLASH(x)         (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_SINGLE_FLASH_SHIFT)) & SPI_FILTER_CR_P0_SINGLE_FLASH_MASK)

#define SPI_FILTER_CR_P0_SINGLE_FLASH_CHIP_SELECT_MASK (0x200U)
#define SPI_FILTER_CR_P0_SINGLE_FLASH_CHIP_SELECT_SHIFT (9U)
/*! P0_SINGLE_FLASH_CHIP_SELECT - Single Flash mode Chip Select
 *  0b0..Enables output to CS0 as the active chip.
 *  0b1..Enables output to CS1 as the active chip.
 */
#define SPI_FILTER_CR_P0_SINGLE_FLASH_CHIP_SELECT(x) (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_SINGLE_FLASH_CHIP_SELECT_SHIFT)) & SPI_FILTER_CR_P0_SINGLE_FLASH_CHIP_SELECT_MASK)

#define SPI_FILTER_CR_P0_SINGLE_FLASH_ALLOW_WRITE_MASK (0x400U)
#define SPI_FILTER_CR_P0_SINGLE_FLASH_ALLOW_WRITE_SHIFT (10U)
/*! P0_SINGLE_FLASH_ALLOW_WRITE - Single Flash Allow Write
 *  0b0..Normal operation. Writes are not allowed to unfiltered regions.
 *  0b1..Writes are allowed to unfiltered regions.
 */
#define SPI_FILTER_CR_P0_SINGLE_FLASH_ALLOW_WRITE(x) (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_SINGLE_FLASH_ALLOW_WRITE_SHIFT)) & SPI_FILTER_CR_P0_SINGLE_FLASH_ALLOW_WRITE_MASK)

#define SPI_FILTER_CR_P1_ACT_SEL_MASK            (0x10000U)
#define SPI_FILTER_CR_P1_ACT_SEL_SHIFT           (16U)
/*! P1_ACT_SEL - Active Chip Select for Flash memory
 *  0b0..Sets CS0 as the read location for the firmware image and sets CS1 as the write location for the FW image.
 *  0b1..Sets CS1 as the read location for the firmware image and sets CS0 as the write location for the FW image.
 */
#define SPI_FILTER_CR_P1_ACT_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_ACT_SEL_SHIFT)) & SPI_FILTER_CR_P1_ACT_SEL_MASK)

#define SPI_FILTER_CR_P1_WE_BYTE_MD_MASK         (0x20000U)
#define SPI_FILTER_CR_P1_WE_BYTE_MD_SHIFT        (17U)
/*! P1_WE_BYTE_MD - Write enable switch for address byte mode
 *  0b0..Write Enable command is not required to switch address byte mode.
 *  0b1..Write Enable command is required prior to switching address byte mode.
 */
#define SPI_FILTER_CR_P1_WE_BYTE_MD(x)           (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_WE_BYTE_MD_SHIFT)) & SPI_FILTER_CR_P1_WE_BYTE_MD_MASK)

#define SPI_FILTER_CR_P1_PERM_BYTE_MD_MASK       (0x40000U)
#define SPI_FILTER_CR_P1_PERM_BYTE_MD_SHIFT      (18U)
/*! P1_PERM_BYTE_MD - Address Byte change mode
 *  0b0..Normal Operation. Address byte mode can be changed as usual.
 *  0b1..Address byte mode cannot be changed.
 */
#define SPI_FILTER_CR_P1_PERM_BYTE_MD(x)         (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_PERM_BYTE_MD_SHIFT)) & SPI_FILTER_CR_P1_PERM_BYTE_MD_MASK)

#define SPI_FILTER_CR_P1_BYTE_SEL_MASK           (0x80000U)
#define SPI_FILTER_CR_P1_BYTE_SEL_SHIFT          (19U)
/*! P1_BYTE_SEL - Address Byte Select
 *  0b0..Sets the filter to 3-byte address mode.
 *  0b1..Sets the filter to 4-byte address mode.
 */
#define SPI_FILTER_CR_P1_BYTE_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_BYTE_SEL_SHIFT)) & SPI_FILTER_CR_P1_BYTE_SEL_MASK)

#define SPI_FILTER_CR_P1_BYTE_SEL_MD_MASK        (0x100000U)
#define SPI_FILTER_CR_P1_BYTE_SEL_MD_SHIFT       (20U)
/*! P1_BYTE_SEL_MD - Address Byte Select Mode
 *  0b0..Normal Operation. The Address byte mode is determined by the Op Code Command.
 *  0b1..Sets the Byte Mode to 3-byte and gives control of the function to the P1_BYTE_SEL in the P1 Filter
 *       Control Register. In this mode, any changes to P1_BYTE_SEL are latched and the internal state of P1_BYTE_SEL
 *       will retain this value when P1_BYTE_SEL_MD is cleared.
 */
#define SPI_FILTER_CR_P1_BYTE_SEL_MD(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_BYTE_SEL_MD_SHIFT)) & SPI_FILTER_CR_P1_BYTE_SEL_MD_MASK)

#define SPI_FILTER_CR_P1_DIRTY_CLR_MASK          (0x200000U)
#define SPI_FILTER_CR_P1_DIRTY_CLR_SHIFT         (21U)
/*! P1_DIRTY_CLR - Clear dirty state for P1 */
#define SPI_FILTER_CR_P1_DIRTY_CLR(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_DIRTY_CLR_SHIFT)) & SPI_FILTER_CR_P1_DIRTY_CLR_MASK)

#define SPI_FILTER_CR_P1_FLT_EN_MASK             (0x400000U)
#define SPI_FILTER_CR_P1_FLT_EN_SHIFT            (22U)
/*! P1_FLT_EN - Filter Enable bit
 *  0b0..Filter Disabled. All CS Disable outputs are asserted so that host access to the flash devices is
 *       disabled. CS# inputs to the filter are disabled so that the filter state machine is locked in its current state.
 *       All register controls are functional.
 *  0b1..Filter Enabled. CS# inputs to the filter are enabled and the filter state machine controls the CS disable
 *       outputs. This bit takes priority over the P1_BYP_EN bit in the Test Register. Setting this bit enables
 *       filtering and enables communication to flash devices regardless of the state of P1_BYP_EN. All other
 *       register controls are functional while filtering is enabled. The filter is enabled by default at CPLD power on.
 */
#define SPI_FILTER_CR_P1_FLT_EN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_FLT_EN_SHIFT)) & SPI_FILTER_CR_P1_FLT_EN_MASK)

#define SPI_FILTER_CR_P1_BYTE_MD_RST_MASK        (0x800000U)
#define SPI_FILTER_CR_P1_BYTE_MD_RST_SHIFT       (23U)
/*! P1_BYTE_MD_RST
 *  0b0..3-byte mode after device reset.
 *  0b1..4-byte mode after device reset.
 */
#define SPI_FILTER_CR_P1_BYTE_MD_RST(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_BYTE_MD_RST_SHIFT)) & SPI_FILTER_CR_P1_BYTE_MD_RST_MASK)

#define SPI_FILTER_CR_P0_ACT_SEL_MASK            (0x1000000U)
#define SPI_FILTER_CR_P0_ACT_SEL_SHIFT           (24U)
/*! P0_ACT_SEL - Active Chip Select for Flash memory
 *  0b0..Sets CS0 as the read location for the firmware image and sets CS1 as the write location for the FW image.
 *  0b1..Sets CS1 as the read location for the firmware image and sets CS0 as the write location for the FW image.
 */
#define SPI_FILTER_CR_P0_ACT_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_ACT_SEL_SHIFT)) & SPI_FILTER_CR_P0_ACT_SEL_MASK)

#define SPI_FILTER_CR_P0_WE_BYTE_MD_MASK         (0x2000000U)
#define SPI_FILTER_CR_P0_WE_BYTE_MD_SHIFT        (25U)
/*! P0_WE_BYTE_MD - Write enable switch for address byte mode
 *  0b0..Write Enable command is not required to switch address byte mode
 *  0b1..Write Enable command is required prior to switching address byte mode
 */
#define SPI_FILTER_CR_P0_WE_BYTE_MD(x)           (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_WE_BYTE_MD_SHIFT)) & SPI_FILTER_CR_P0_WE_BYTE_MD_MASK)

