zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SPI_FILTER.h
#define SPI_FILTER_CR_P0_PERM_BYTE_MD_MASK       (0x4000000U)
#define SPI_FILTER_CR_P0_PERM_BYTE_MD_SHIFT      (26U)
/*! P0_PERM_BYTE_MD - Address Byte change mode
 *  0b0..Normal Operation. Address byte mode can be changed as usual.
 *  0b1..Address byte mode cannot be changed.
 */
#define SPI_FILTER_CR_P0_PERM_BYTE_MD(x)         (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_PERM_BYTE_MD_SHIFT)) & SPI_FILTER_CR_P0_PERM_BYTE_MD_MASK)

#define SPI_FILTER_CR_P0_BYTE_SEL_MASK           (0x8000000U)
#define SPI_FILTER_CR_P0_BYTE_SEL_SHIFT          (27U)
/*! P0_BYTE_SEL - Address Byte Select Mode for P0
 *  0b0..Sets the filter to 3-byte address mode
 *  0b1..Sets the filter to 4-byte address mode
 */
#define SPI_FILTER_CR_P0_BYTE_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_BYTE_SEL_SHIFT)) & SPI_FILTER_CR_P0_BYTE_SEL_MASK)

#define SPI_FILTER_CR_P0_BYTE_SEL_MD_MASK        (0x10000000U)
#define SPI_FILTER_CR_P0_BYTE_SEL_MD_SHIFT       (28U)
/*! P0_BYTE_SEL_MD - Address Byte Select Mode
 *  0b0..Normal Operation. The Address byte mode is determined by the Op Code Command
 *  0b1..Sets the Byte Mode to 3-byte and gives control of the function to the P0_BYTE_SEL in the P0 Filter
 *       Control Register. In this mode, any changes to P0_BYTE_SEL are latched and the internal state of BYTE_SEL will
 *       retain this value when P0_BYTE_SEL_MD is cleared
 */
#define SPI_FILTER_CR_P0_BYTE_SEL_MD(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_BYTE_SEL_MD_SHIFT)) & SPI_FILTER_CR_P0_BYTE_SEL_MD_MASK)

#define SPI_FILTER_CR_P0_DIRTY_CLR_MASK          (0x20000000U)
#define SPI_FILTER_CR_P0_DIRTY_CLR_SHIFT         (29U)
/*! P0_DIRTY_CLR - Clear dirty state for P0 */
#define SPI_FILTER_CR_P0_DIRTY_CLR(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_DIRTY_CLR_SHIFT)) & SPI_FILTER_CR_P0_DIRTY_CLR_MASK)

#define SPI_FILTER_CR_P0_FLT_EN_MASK             (0x40000000U)
#define SPI_FILTER_CR_P0_FLT_EN_SHIFT            (30U)
/*! P0_FLT_EN - Filter Enable bit
 *  0b0..Filter Disabled. All CS Disable outputs are asserted so that host access to the flash devices is
 *       disabled. CS# inputs to the filter are disabled so that the filter state machine is locked in its current state.
 *       All other register controls can be accessed, but have no impact on the functionality of the filter while
 *       the filter is disabled.
 *  0b1..Filter Enabled. CS# inputs to the filter are enabled and the filter state machine controls the CS disable
 *       outputs. CS# inputs to the filter are enabled so that the filter state machine is active. All other
 *       register controls are functional. The filter is enabled by default at CPLD power on.
 */
#define SPI_FILTER_CR_P0_FLT_EN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_FLT_EN_SHIFT)) & SPI_FILTER_CR_P0_FLT_EN_MASK)

#define SPI_FILTER_CR_P0_BYTE_MD_RST_MASK        (0x80000000U)
#define SPI_FILTER_CR_P0_BYTE_MD_RST_SHIFT       (31U)
/*! P0_BYTE_MD_RST
 *  0b0..3-byte mode after device reset.
 *  0b1..4-byte mode after device reset.
 */
#define SPI_FILTER_CR_P0_BYTE_MD_RST(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_BYTE_MD_RST_SHIFT)) & SPI_FILTER_CR_P0_BYTE_MD_RST_MASK)
/*! @} */

/*! @name ISR - Interrupt Register */
/*! @{ */

#define SPI_FILTER_ISR_P0_F8_INT_MASK            (0x1000000U)
#define SPI_FILTER_ISR_P0_F8_INT_SHIFT           (24U)
/*! P0_F8_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates an F8 command has been detected
 */
#define SPI_FILTER_ISR_P0_F8_INT(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_F8_INT_SHIFT)) & SPI_FILTER_ISR_P0_F8_INT_MASK)

#define SPI_FILTER_ISR_P1_F8_INT_MASK            (0x2000000U)
#define SPI_FILTER_ISR_P1_F8_INT_SHIFT           (25U)
/*! P1_F8_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates an F8 command has been detected
 */
#define SPI_FILTER_ISR_P1_F8_INT(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_F8_INT_SHIFT)) & SPI_FILTER_ISR_P1_F8_INT_MASK)

#define SPI_FILTER_ISR_P0_DIRTY_INT_MASK         (0x4000000U)
#define SPI_FILTER_ISR_P0_DIRTY_INT_SHIFT        (26U)
/*! P0_DIRTY_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a write has occurred to the FW Code region of the inactive Flash and that flash is now considered corrupt.
 */
#define SPI_FILTER_ISR_P0_DIRTY_INT(x)           (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_DIRTY_INT_SHIFT)) & SPI_FILTER_ISR_P0_DIRTY_INT_MASK)

#define SPI_FILTER_ISR_P1_DIRTY_INT_MASK         (0x8000000U)
#define SPI_FILTER_ISR_P1_DIRTY_INT_SHIFT        (27U)
/*! P1_DIRTY_INT
 *  0b0..Indicates normal operation
 *  0b1..indicates that a write has occurred to the FW Code region of the inactive Flash and that flash is now considered corrupt
 */
#define SPI_FILTER_ISR_P1_DIRTY_INT(x)           (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_DIRTY_INT_SHIFT)) & SPI_FILTER_ISR_P1_DIRTY_INT_MASK)

#define SPI_FILTER_ISR_P0_BLK_INT_MASK           (0x10000000U)
#define SPI_FILTER_ISR_P0_BLK_INT_SHIFT          (28U)
/*! P0_BLK_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a blocked opcode has been detected
 */
#define SPI_FILTER_ISR_P0_BLK_INT(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_BLK_INT_SHIFT)) & SPI_FILTER_ISR_P0_BLK_INT_MASK)

#define SPI_FILTER_ISR_P1_BLK_INT_MASK           (0x20000000U)
#define SPI_FILTER_ISR_P1_BLK_INT_SHIFT          (29U)
/*! P1_BLK_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a blocked opcode has been detected
 */
#define SPI_FILTER_ISR_P1_BLK_INT(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_BLK_INT_SHIFT)) & SPI_FILTER_ISR_P1_BLK_INT_MASK)

#define SPI_FILTER_ISR_P0_BYTEMODE_INT_MASK      (0x40000000U)
#define SPI_FILTER_ISR_P0_BYTEMODE_INT_SHIFT     (30U)
/*! P0_BYTEMODE_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a Bytemode change has been detected (OpCode E9 or B7)
 */
#define SPI_FILTER_ISR_P0_BYTEMODE_INT(x)        (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_BYTEMODE_INT_SHIFT)) & SPI_FILTER_ISR_P0_BYTEMODE_INT_MASK)

#define SPI_FILTER_ISR_P1_BYTEMODE_INT_MASK      (0x80000000U)
#define SPI_FILTER_ISR_P1_BYTEMODE_INT_SHIFT     (31U)
/*! P1_BYTEMODE_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a Bytemode change has been detected (OpCode E9 or B7)
 */
#define SPI_FILTER_ISR_P1_BYTEMODE_INT(x)        (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_BYTEMODE_INT_SHIFT)) & SPI_FILTER_ISR_P1_BYTEMODE_INT_MASK)
/*! @} */

/*! @name IMR - Interrupt Mask Register */
/*! @{ */

#define SPI_FILTER_IMR_P0_F8_MASK_MASK           (0x1000000U)
#define SPI_FILTER_IMR_P0_F8_MASK_SHIFT          (24U)
/*! P0_F8_MASK
 *  0b0..Indicates P0_F8_INT interrupt is enabled.
 *  0b1..Indicates P0_F8_INT interrupt is disabled.
 */
#define SPI_FILTER_IMR_P0_F8_MASK(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_F8_MASK_SHIFT)) & SPI_FILTER_IMR_P0_F8_MASK_MASK)

#define SPI_FILTER_IMR_P1_F8_MASK_MASK           (0x2000000U)
#define SPI_FILTER_IMR_P1_F8_MASK_SHIFT          (25U)
/*! P1_F8_MASK
 *  0b0..Indicates P1_F8_INT interrupt is enabled.
 *  0b1..Indicates P1_F8_INT interrupt is disabled.
 */
#define SPI_FILTER_IMR_P1_F8_MASK(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_F8_MASK_SHIFT)) & SPI_FILTER_IMR_P1_F8_MASK_MASK)

#define SPI_FILTER_IMR_P0_DIRTY_MASK_MASK        (0x4000000U)
#define SPI_FILTER_IMR_P0_DIRTY_MASK_SHIFT       (26U)
/*! P0_DIRTY_MASK
 *  0b0..Indicates P0_DIRTY_INT interrupt is enabled.
 *  0b1..Indicates P0_DIRTY_INT interrupt is disabled.
 */
#define SPI_FILTER_IMR_P0_DIRTY_MASK(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_DIRTY_MASK_SHIFT)) & SPI_FILTER_IMR_P0_DIRTY_MASK_MASK)

#define SPI_FILTER_IMR_P1_DIRTY_MASK_MASK        (0x8000000U)
#define SPI_FILTER_IMR_P1_DIRTY_MASK_SHIFT       (27U)
/*! P1_DIRTY_MASK
 *  0b0..Indicates P1_DIRTY_INT interrupt is enabled.
 *  0b1..Indicates P1_DIRTY_INT interrupt is disabled.
 */
#define SPI_FILTER_IMR_P1_DIRTY_MASK(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_DIRTY_MASK_SHIFT)) & SPI_FILTER_IMR_P1_DIRTY_MASK_MASK)

