zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SPI_FILTER.h
#define SPI_FILTER_IMR_P0_BLK_MASK_MASK          (0x10000000U)
#define SPI_FILTER_IMR_P0_BLK_MASK_SHIFT         (28U)
/*! P0_BLK_MASK
 *  0b0..Indicates P0_BLK_INT is enabled.
 *  0b1..Indicates P0_BLK_INT is disabled.
 */
#define SPI_FILTER_IMR_P0_BLK_MASK(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_BLK_MASK_SHIFT)) & SPI_FILTER_IMR_P0_BLK_MASK_MASK)

#define SPI_FILTER_IMR_P1_BLK_MASK_MASK          (0x20000000U)
#define SPI_FILTER_IMR_P1_BLK_MASK_SHIFT         (29U)
/*! P1_BLK_MASK
 *  0b0..Indicates P1_BLK_INT is enabled.
 *  0b1..Indicates P1_BLK_INT is disabled.
 */
#define SPI_FILTER_IMR_P1_BLK_MASK(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_BLK_MASK_SHIFT)) & SPI_FILTER_IMR_P1_BLK_MASK_MASK)

#define SPI_FILTER_IMR_P0_BYTEMODE_MASK_MASK     (0x40000000U)
#define SPI_FILTER_IMR_P0_BYTEMODE_MASK_SHIFT    (30U)
/*! P0_BYTEMODE_MASK
 *  0b0..Indicates P0_BYTEMODE_INT is enabled.
 *  0b1..Indicates P0_BYTEMODE_INT is disabled.
 */
#define SPI_FILTER_IMR_P0_BYTEMODE_MASK(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_BYTEMODE_MASK_SHIFT)) & SPI_FILTER_IMR_P0_BYTEMODE_MASK_MASK)

#define SPI_FILTER_IMR_P1_BYTEMODE_MASK_MASK     (0x80000000U)
#define SPI_FILTER_IMR_P1_BYTEMODE_MASK_SHIFT    (31U)
/*! P1_BYTEMODE_MASK
 *  0b0..Indicates P1_BYTEMODE_INT is enabled.
 *  0b1..Indicates P1_BYTEMODE_INT is disabled.
 */
#define SPI_FILTER_IMR_P1_BYTEMODE_MASK(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_BYTEMODE_MASK_SHIFT)) & SPI_FILTER_IMR_P1_BYTEMODE_MASK_MASK)
/*! @} */

/*! @name SR - Port Status Register */
/*! @{ */

#define SPI_FILTER_SR_P1_DIRTY_MASK              (0x10000U)
#define SPI_FILTER_SR_P1_DIRTY_SHIFT             (16U)
/*! P1_DIRTY
 *  0b0..Indicates normal operation. No Writes have been directed to the inactive Flash
 *  0b1..Indicates that a write to the inactive Flash has been detected and the state of the flash should be considered "dirty".
 */
#define SPI_FILTER_SR_P1_DIRTY(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P1_DIRTY_SHIFT)) & SPI_FILTER_SR_P1_DIRTY_MASK)

#define SPI_FILTER_SR_P1_BYTE_MODE_MASK          (0x20000U)
#define SPI_FILTER_SR_P1_BYTE_MODE_SHIFT         (17U)
/*! P1_BYTE_MODE
 *  0b0..3-Byte Address Mode
 *  0b1..4-Byte Address Mode
 */
#define SPI_FILTER_SR_P1_BYTE_MODE(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P1_BYTE_MODE_SHIFT)) & SPI_FILTER_SR_P1_BYTE_MODE_MASK)

#define SPI_FILTER_SR_P1_WRITE_EN_MASK           (0x40000U)
#define SPI_FILTER_SR_P1_WRITE_EN_SHIFT          (18U)
/*! P1_WRITE_EN - Write enable command status
 *  0b0..Write enable command is not detected
 *  0b1..Write enable command is detected
 */
#define SPI_FILTER_SR_P1_WRITE_EN(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P1_WRITE_EN_SHIFT)) & SPI_FILTER_SR_P1_WRITE_EN_MASK)

#define SPI_FILTER_SR_P0_DIRTY_MASK              (0x1000000U)
#define SPI_FILTER_SR_P0_DIRTY_SHIFT             (24U)
/*! P0_DIRTY
 *  0b0..Indicates normal operation. No Writes have been directed to the inactive Flash
 *  0b1..Indicates that a write to the inactive Flash has been detected and the state of the flash should be considered "dirty".
 */
#define SPI_FILTER_SR_P0_DIRTY(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P0_DIRTY_SHIFT)) & SPI_FILTER_SR_P0_DIRTY_MASK)

#define SPI_FILTER_SR_P0_BYTE_MODE_MASK          (0x2000000U)
#define SPI_FILTER_SR_P0_BYTE_MODE_SHIFT         (25U)
/*! P0_BYTE_MODE
 *  0b0..3-Byte Address Mode
 *  0b1..4-Byte Address Mode
 */
#define SPI_FILTER_SR_P0_BYTE_MODE(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P0_BYTE_MODE_SHIFT)) & SPI_FILTER_SR_P0_BYTE_MODE_MASK)

#define SPI_FILTER_SR_P0_WRITE_EN_MASK           (0x4000000U)
#define SPI_FILTER_SR_P0_WRITE_EN_SHIFT          (26U)
/*! P0_WRITE_EN - Write enable command status
 *  0b0..Write enable command is not detected
 *  0b1..Write enable command is detected
 */
#define SPI_FILTER_SR_P0_WRITE_EN(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P0_WRITE_EN_SHIFT)) & SPI_FILTER_SR_P0_WRITE_EN_MASK)
/*! @} */

/*! @name TR - Test Register */
/*! @{ */

#define SPI_FILTER_TR_P0_BYP_SEL_MASK            (0x10000U)
#define SPI_FILTER_TR_P0_BYP_SEL_SHIFT           (16U)
/*! P0_BYP_SEL
 *  0b0..CS0
 *  0b1..CS1
 */
#define SPI_FILTER_TR_P0_BYP_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TR_P0_BYP_SEL_SHIFT)) & SPI_FILTER_TR_P0_BYP_SEL_MASK)

#define SPI_FILTER_TR_P0_BYP_EN_MASK             (0x20000U)
#define SPI_FILTER_TR_P0_BYP_EN_SHIFT            (17U)
/*! P0_BYP_EN
 *  0b0..Filter Bypass Disabled
 *  0b1..Filter Bypass Enabled
 */
#define SPI_FILTER_TR_P0_BYP_EN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TR_P0_BYP_EN_SHIFT)) & SPI_FILTER_TR_P0_BYP_EN_MASK)

#define SPI_FILTER_TR_P1_BYP_SEL_MASK            (0x40000U)
#define SPI_FILTER_TR_P1_BYP_SEL_SHIFT           (18U)
/*! P1_BYP_SEL
 *  0b0..CS0
 *  0b1..CS1
 */
#define SPI_FILTER_TR_P1_BYP_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TR_P1_BYP_SEL_SHIFT)) & SPI_FILTER_TR_P1_BYP_SEL_MASK)

#define SPI_FILTER_TR_P1_BYP_EN_MASK             (0x80000U)
#define SPI_FILTER_TR_P1_BYP_EN_SHIFT            (19U)
/*! P1_BYP_EN
 *  0b0..Filter Bypass Disabled
 *  0b1..Filter Bypass Enabled
 */
#define SPI_FILTER_TR_P1_BYP_EN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TR_P1_BYP_EN_SHIFT)) & SPI_FILTER_TR_P1_BYP_EN_MASK)

#define SPI_FILTER_TR_P0_FF_BYP_EN_MASK          (0x100000U)
#define SPI_FILTER_TR_P0_FF_BYP_EN_SHIFT         (20U)
/*! P0_FF_BYP_EN
 *  0b0..Bypass Neg FF for CS Disabled
 *  0b1..Bypass Neg FF for CS Enabled
 */
#define SPI_FILTER_TR_P0_FF_BYP_EN(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TR_P0_FF_BYP_EN_SHIFT)) & SPI_FILTER_TR_P0_FF_BYP_EN_MASK)

#define SPI_FILTER_TR_P1_FF_BYP_EN_MASK          (0x200000U)
#define SPI_FILTER_TR_P1_FF_BYP_EN_SHIFT         (21U)
/*! P1_FF_BYP_EN
 *  0b0..Bypass Neg FF for CS Disabled
 *  0b1..Bypass Neg FF for CS Enabled
 */
#define SPI_FILTER_TR_P1_FF_BYP_EN(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TR_P1_FF_BYP_EN_SHIFT)) & SPI_FILTER_TR_P1_FF_BYP_EN_MASK)

#define SPI_FILTER_TR_P0_MFG_ID_MASK             (0xF000000U)
#define SPI_FILTER_TR_P0_MFG_ID_SHIFT            (24U)
/*! P0_MFG_ID - Sets the Flash memory manufacturer
 *  0b0000..Macronix
 *  0b0001..Windbond
 *  0b0010..Micron
 */
#define SPI_FILTER_TR_P0_MFG_ID(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TR_P0_MFG_ID_SHIFT)) & SPI_FILTER_TR_P0_MFG_ID_MASK)

#define SPI_FILTER_TR_P1_MFG_ID_MASK             (0xF0000000U)
#define SPI_FILTER_TR_P1_MFG_ID_SHIFT            (28U)
/*! P1_MFG_ID - Sets the Flash memory manufacturer
 *  0b0000..Macronix
 *  0b0001..Windbond
 *  0b0010..Micron
 */
#define SPI_FILTER_TR_P1_MFG_ID(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TR_P1_MFG_ID_SHIFT)) & SPI_FILTER_TR_P1_MFG_ID_MASK)
/*! @} */

