zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SPI_FILTER.h
#define SPI_FILTER_POPCODE2_PRG_OPCODE2_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE2_PRG_OPCODE2_SHIFT    (24U)
/*! PRG_OPCODE2 - Programmable OP Code 0 */
#define SPI_FILTER_POPCODE2_PRG_OPCODE2(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE2_PRG_OPCODE2_SHIFT)) & SPI_FILTER_POPCODE2_PRG_OPCODE2_MASK)
/*! @} */

/*! @name POPCODE3 - Programmable OP Code3 */
/*! @{ */

#define SPI_FILTER_POPCODE3_FILTER_STATE3_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE3_FILTER_STATE3_SHIFT  (16U)
/*! FILTER_STATE3 - Programmable Filter state 3 */
#define SPI_FILTER_POPCODE3_FILTER_STATE3(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE3_FILTER_STATE3_SHIFT)) & SPI_FILTER_POPCODE3_FILTER_STATE3_MASK)

#define SPI_FILTER_POPCODE3_FILTER_BIT3_MASK     (0x200000U)
#define SPI_FILTER_POPCODE3_FILTER_BIT3_SHIFT    (21U)
/*! FILTER_BIT3
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE3_FILTER_BIT3(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE3_FILTER_BIT3_SHIFT)) & SPI_FILTER_POPCODE3_FILTER_BIT3_MASK)

#define SPI_FILTER_POPCODE3_PRG_OPCODE3_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE3_PRG_OPCODE3_SHIFT    (24U)
/*! PRG_OPCODE3 - Programmable OP Code 3 */
#define SPI_FILTER_POPCODE3_PRG_OPCODE3(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE3_PRG_OPCODE3_SHIFT)) & SPI_FILTER_POPCODE3_PRG_OPCODE3_MASK)
/*! @} */

/*! @name POPCODE4 - Programmable OP Code4 */
/*! @{ */

#define SPI_FILTER_POPCODE4_FILTER_STATE4_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE4_FILTER_STATE4_SHIFT  (16U)
/*! FILTER_STATE4 - Programmable Filter state 4 */
#define SPI_FILTER_POPCODE4_FILTER_STATE4(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE4_FILTER_STATE4_SHIFT)) & SPI_FILTER_POPCODE4_FILTER_STATE4_MASK)

#define SPI_FILTER_POPCODE4_FILTER_BIT4_MASK     (0x200000U)
#define SPI_FILTER_POPCODE4_FILTER_BIT4_SHIFT    (21U)
/*! FILTER_BIT4
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE4_FILTER_BIT4(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE4_FILTER_BIT4_SHIFT)) & SPI_FILTER_POPCODE4_FILTER_BIT4_MASK)

#define SPI_FILTER_POPCODE4_PRG_OPCODE4_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE4_PRG_OPCODE4_SHIFT    (24U)
/*! PRG_OPCODE4 - Programmable OP Code 4 */
#define SPI_FILTER_POPCODE4_PRG_OPCODE4(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE4_PRG_OPCODE4_SHIFT)) & SPI_FILTER_POPCODE4_PRG_OPCODE4_MASK)
/*! @} */

/*! @name P0BOC - P0 Blocked Op Code */
/*! @{ */

#define SPI_FILTER_P0BOC_P0BOC_MASK              (0xFF000000U)
#define SPI_FILTER_P0BOC_P0BOC_SHIFT             (24U)
/*! P0BOC - PORT0 Blocked Op Code */
#define SPI_FILTER_P0BOC_P0BOC(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0BOC_P0BOC_SHIFT)) & SPI_FILTER_P0BOC_P0BOC_MASK)
/*! @} */

/*! @name P1BOC - P1 Blocked Op Code */
/*! @{ */

#define SPI_FILTER_P1BOC_P1BOC_MASK              (0xFF000000U)
#define SPI_FILTER_P1BOC_P1BOC_SHIFT             (24U)
/*! P1BOC - PORT1 Blocked Op Code */
#define SPI_FILTER_P1BOC_P1BOC(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1BOC_P1BOC_SHIFT)) & SPI_FILTER_P1BOC_P1BOC_MASK)
/*! @} */

/*! @name P0MAM - PORT0 Max Address Mask */
/*! @{ */

#define SPI_FILTER_P0MAM_P0MAML_MASK             (0xFF0000U)
#define SPI_FILTER_P0MAM_P0MAML_SHIFT            (16U)
#define SPI_FILTER_P0MAM_P0MAML(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0MAM_P0MAML_SHIFT)) & SPI_FILTER_P0MAM_P0MAML_MASK)

#define SPI_FILTER_P0MAM_P0MAMM_MASK             (0xFF000000U)
#define SPI_FILTER_P0MAM_P0MAMM_SHIFT            (24U)
#define SPI_FILTER_P0MAM_P0MAMM(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0MAM_P0MAMM_SHIFT)) & SPI_FILTER_P0MAM_P0MAMM_MASK)
/*! @} */

/*! @name P1MAM - PORT1 Max Address Mask */
/*! @{ */

#define SPI_FILTER_P1MAM_P1MAML_MASK             (0xFF0000U)
#define SPI_FILTER_P1MAM_P1MAML_SHIFT            (16U)
#define SPI_FILTER_P1MAM_P1MAML(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1MAM_P1MAML_SHIFT)) & SPI_FILTER_P1MAM_P1MAML_MASK)

#define SPI_FILTER_P1MAM_P1MAMM_MASK             (0xFF000000U)
#define SPI_FILTER_P1MAM_P1MAMM_SHIFT            (24U)
/*! P1MAMM - PORT1 Max Address Mask MSB */
#define SPI_FILTER_P1MAM_P1MAMM(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1MAM_P1MAMM_SHIFT)) & SPI_FILTER_P1MAM_P1MAMM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SPI_FILTER_Register_Masks */


/*!
 * @}
 */ /* end of group SPI_FILTER_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SPI_FILTER_H_ */

